TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L1306/driverlib/empty_driverlib_src/ti/driverlib/dl_rtc.h
/*
 * Copyright (c) 2020, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*!****************************************************************************
 *  @file       dl_rtc.h
 *  @brief      Real Time Clock (RTC) Peripheral Interface
 *  @defgroup   RTC Real Time Clock (RTC)
 *
 *  @anchor ti_devices_msp_dl_rtc_Overview
 *  # Overview
 *  The RTC Driver Library allows full configuration of the MSPM0 RTC module.
 *  The real-time clock (RTC) module provides clock counters with calendar mode,
 *  a flexible programmable alarm, offset calibration, and a provision for
 *  temperature compensation.
 *
 *  <hr>
 ******************************************************************************
 */
/** @addtogroup RTC
 * @{
 */
#ifndef ti_dl_dl_rtc__include
#define ti_dl_dl_rtc__include

#include <stdbool.h>
#include <stdint.h>

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/dl_common.h>

#ifdef __MSPM0_HAS_RTC__

#ifdef __cplusplus
extern "C" {
#endif

/* clang-format off */

/** @addtogroup DL_RTC_INTERRUPT
 *  @{
 */

/**
 * @brief RTC alarm 1 interrupt
 */
#define DL_RTC_INTERRUPT_CALENDAR_ALARM1        (RTC_CPU_INT_IMASK_RTCA1_SET)

/**
 * @brief RTC alarm 2 interrupt
 */
#define DL_RTC_INTERRUPT_CALENDAR_ALARM2        (RTC_CPU_INT_IMASK_RTCA2_SET)

/**
 * @brief RTC prescaler 0 interrupt
 */
#define DL_RTC_INTERRUPT_PRESCALER0             (RTC_CPU_INT_IMASK_RT0PS_SET)

/**
 * @brief RTC prescaler 1 interrupt
 */
#define DL_RTC_INTERRUPT_PRESCALER1             (RTC_CPU_INT_IMASK_RT1PS_SET)

/**
 * @brief RTC interval timer interrupt
 */
#define DL_RTC_INTERRUPT_INTERVAL_ALARM        (RTC_CPU_INT_IMASK_RTCTEV_SET)

/**
 * @brief RTC ready interrupt
 */
#define DL_RTC_INTERRUPT_READY                 (RTC_CPU_INT_IMASK_RTCRDY_SET)

/** @}*/

/** @addtogroup DL_RTC_EVENT
 *  @{
 */

/**
 * @brief RTC alarm 1 event
 */
#define DL_RTC_EVENT_CALENDAR_ALARM1            (RTC_GEN_EVENT_IMASK_RTCA1_SET)

/**
 * @brief RTC alarm 2 event
 */
#define DL_RTC_EVENT_CALENDAR_ALARM2            (RTC_GEN_EVENT_IMASK_RTCA2_SET)

/**
 * @brief RTC prescaler 0 event
 */
#define DL_RTC_EVENT_PRESCALER0                 (RTC_GEN_EVENT_IMASK_RT0PS_SET)

/**
 * @brief RTC prescaler 1 event
 */
#define DL_RTC_EVENT_PRESCALER1                 (RTC_GEN_EVENT_IMASK_RT1PS_SET)

/**
 * @brief RTC interval timer event
 */
#define DL_RTC_EVENT_INTERVAL_ALARM            (RTC_GEN_EVENT_IMASK_RTCTEV_SET)

/**
 * @brief RTC ready event
 */
#define DL_RTC_EVENT_READY                     (RTC_GEN_EVENT_IMASK_RTCRDY_SET)


/** @}*/

/*! @enum DL_RTC_STATUS */
typedef enum {
    /*! RTC is safe for reading */
    DL_RTC_STATUS_READY = RTC_STA_RTCRDY_READY,
    /*! RTC is not safe for reading */
    DL_RTC_STATUS_NOT_READY = RTC_STA_RTCRDY_NOT_READY
} DL_RTC_STATUS;

/*! @enum DL_RTC_COMPENSATION_STATUS */
typedef enum {
    /*! RTC ready to get new compensation values */
    DL_RTC_COMPENSATION_STATUS_READY = RTC_STA_RTCTCRDY_READY,
    /*! RTC not ready to get new compensaiton values */
    DL_RTC_COMPENSATION_STATUS_NOT_READY = RTC_STA_RTCTCRDY_NOT_READY
} DL_RTC_COMPENSATION_STATUS;

/*! @enum DL_RTC_COMPENSATION_WRITE_RESULT */
typedef enum {
    /*! Compensation write successful */
    DL_RTC_COMPENSATION_WRITE_RESULT_OK = RTC_STA_RTCTCOK_OK,
    /*! Compensation write unsuccessful */
    DL_RTC_COMPENSATION_WRITE_RESULT_NOT_OK = RTC_STA_RTCTCOK_NOT_OK
} DL_RTC_COMPENSATION_WRITE_RESULT;

/*! @enum DL_RTC_OFFSET_CALIBRATION_SIGN */
typedef enum {
    /*! Calibration frequency adjusted down */
    DL_RTC_OFFSET_CALIBRATION_SIGN_DOWN = RTC_CAL_RTCOCALS_DOWN,
    /*! Calibration frequency adjusted up */
    DL_RTC_OFFSET_CALIBRATION_SIGN_UP = RTC_CAL_RTCOCALS_UP
} DL_RTC_OFFSET_CALIBRATION_SIGN;

/*! @enum DL_RTC_OFFSET_CALIBRATION_FREQUENCY */
typedef enum {
    /*! No frequency output to RTCCLK pin */
    DL_RTC_OFFSET_CALIBRATION_FREQUENCY_OFF = RTC_CAL_RTCCALFX_OFF,
    /*! 512 Hz frequency output to RTCLK pin */
    DL_RTC_OFFSET_CALIBRATION_FREQUENCY_512 = RTC_CAL_RTCCALFX_F512HZ,
    /*! 256 Hz frequency output to RTCLK pin */
    DL_RTC_OFFSET_CALIBRATION_FREQUENCY_256 = RTC_CAL_RTCCALFX_F256HZ,
    /*! 1 Hz frequency output to RTCLK pin */
    DL_RTC_OFFSET_CALIBRATION_FREQUENCY_1 = RTC_CAL_RTCCALFX_F1HZ
} DL_RTC_OFFSET_CALIBRATION_FREQUENCY;

/*! @enum DL_RTC_TEMP_CALIBRATION */
typedef enum {
    /*! Calibrate at steps of -1 */
    DL_RTC_TEMP_CALIBRATION_DOWN1PPM = RTC_TCMP_RTCTCMPS_DOWN,
    /*! Calibrate at steps of +1 */
    DL_RTC_TEMP_CALIBRATION_UP1PPM = RTC_TCMP_RTCTCMPS_UP
} DL_RTC_TEMP_CALIBRATION;

/*! @enum DL_RTC_FORMAT */
typedef enum {
    /*! Select binary format for the real-time clock */
    DL_RTC_FORMAT_BINARY = RTC_CTL_RTCBCD_BINARY,
    /*! Select BCD format for the real-time clock */
    DL_RTC_FORMAT_BCD = RTC_CTL_RTCBCD_BCD
} DL_RTC_FORMAT;

/*! @enum DL_RTC_INTERVAL_ALARM */
typedef enum {
    /*! Assert Calendar interrupt on every minute */
    DL_RTC_INTERVAL_ALARM_MINUTECHANGE = RTC_CTL_RTCTEVTX_MINUTE,
    /*! Assert Calendar interrupt on every hour */
    DL_RTC_INTERVAL_ALARM_HOURCHANGE = RTC_CTL_RTCTEVTX_HOUR,
    /*! Assert Calendar interrupt when hour is 12 */
    DL_RTC_INTERVAL_ALARM_NOON = RTC_CTL_RTCTEVTX_NOON,
    /*! Assert Calendar interrupt when hour is 0 */
    DL_RTC_INTERVAL_ALARM_MIDNIGHT = RTC_CTL_RTCTEVTX_MIDNIGHT
} DL_RTC_INTERVAL_ALARM;

/*! @enum DL_RTC_PRESCALER0_DIVIDE */
typedef enum {
    /*! Prescaler 0 Divide by 8 */
    DL_RTC_PRESCALER0_DIVIDE_8 = RTC_PSCTL_RT0IP_DIV8,
    /*! Prescaler 0 Divide by 16 */
    DL_RTC_PRESCALER0_DIVIDE_16 = RTC_PSCTL_RT0IP_DIV16,
    /*! Prescaler 0 Divide by 32 */
    DL_RTC_PRESCALER0_DIVIDE_32 = RTC_PSCTL_RT0IP_DIV32,
    /*! Prescaler 0 Divide by 64 */
    DL_RTC_PRESCALER0_DIVIDE_64 = RTC_PSCTL_RT0IP_DIV64,
    /*! Prescaler 0 Divide by 128 */
    DL_RTC_PRESCALER0_DIVIDE_128 = RTC_PSCTL_RT0IP_DIV128,
    /*! Prescaler 0 Divide by 256 */
    DL_RTC_PRESCALER0_DIVIDE_256 = RTC_PSCTL_RT0IP_DIV256
} DL_RTC_PRESCALER0_DIVIDE;

/*! @enum DL_RTC_PRESCALER1_DIVIDE */
typedef enum {
    /*! Prescaler 1 Divide by 2 */
    DL_RTC_PRESCALER1_DIVIDE_2 = RTC_PSCTL_RT1IP_DIV2,
    /*! Prescaler 1 Divide by 4 */
    DL_RTC_PRESCALER1_DIVIDE_4 = RTC_PSCTL_RT1IP_DIV4,
    /*! Prescaler 1 Divide by 8 */
    DL_RTC_PRESCALER1_DIVIDE_8 = RTC_PSCTL_RT1IP_DIV8,
    /*! Prescaler 1 Divide by 16 */
    DL_RTC_PRESCALER1_DIVIDE_16 = RTC_PSCTL_RT1IP_DIV16,
    /*! Prescaler 1 Divide by 32 */
    DL_RTC_PRESCALER1_DIVIDE_32 = RTC_PSCTL_RT1IP_DIV32,
    /*! Prescaler 1 Divide by 64 */
    DL_RTC_PRESCALER1_DIVIDE_64 = RTC_PSCTL_RT1IP_DIV64,
    /*! Prescaler 1 Divide by 128 */
    DL_RTC_PRESCALER1_DIVIDE_128 = RTC_PSCTL_RT1IP_DIV128,
    /*! Prescaler 1 Divide by 256 */
    DL_RTC_PRESCALER1_DIVIDE_256 = RTC_PSCTL_RT1IP_DIV256
} DL_RTC_PRESCALER1_DIVIDE;

/*! @enum DL_RTC_IIDX */
typedef enum {
    /*! RTC interrupt index for alarm 1 */
    DL_RTC_IIDX_ALARM1 = RTC_CPU_INT_IIDX_STAT_RTCA1,
    /*! RTC interrupt index for alarm 2 */
    DL_RTC_IIDX_ALARM2 = RTC_CPU_INT_IIDX_STAT_RTCA2,
    /*! RTC interrupt index for prescaler 0 */
    DL_RTC_IIDX_PRESCALER0 = RTC_CPU_INT_IIDX_STAT_RT0PS,
    /*! RTC interrupt index for prescaler 1 */
    DL_RTC_IIDX_PRESCALER1 = RTC_CPU_INT_IIDX_STAT_RT1PS,
    /*! RTC interrupt index for interval timer */
    DL_RTC_IIDX_INTERVAL_TIMER = RTC_CPU_INT_IIDX_STAT_RTCTEV,
    /*! RTC interrupt index for RTC ready */
    DL_RTC_IIDX_READY = RTC_CPU_INT_IIDX_STAT_RTCRDY
} DL_RTC_IIDX;

/* clang-format on */

/**
 * @brief   Alarm struct to use in DL_RTC_setCalendarAlarm
 *
 * @note    All struct values must be in the same format (Binary OR BCD).
 *          RTC format is set during initialization.
 */
typedef struct {
    /** The minute to set the Alarm time to. Valid values are 0-59 in Binary
     * format OR 0x0-0x59 in BCD format. */
    uint8_t minutes;
    /** The hour to set the Alarm time to. Valid values are 0-23 in Binary
     * format OR 0x0-0x23 in BCD format. */
    uint8_t hours;
    /** The day of the week to set the Alarm time to. Valid values are 0-6
     * in Binary format OR 0x0-0x6 in BCD format. */
    uint8_t dayOfWeek;
    /** The day of the month to set the Alarm time to. Valid values are 1-31
     * in Binary format OR 0x1-0x31 in BCD format. */
    uint8_t dayOfMonth;
} DL_RTC_CalendarAlarm;

/**
 * @brief   Calendar struct to use in DL_RTC_initCalendar()
 *
 * @note    All struct values must be in the same format (Binary OR BCD).
 *          RTC format is set during initialization.
 */
typedef struct {
    /** The second to set the Calendar time to. Valid values are 0-59 in Binary
     * format OR 0x0-0x59 in BCD format. */
    uint8_t seconds;
    /** The minute to set the Calendar time to. Valid values are 0-59 in Binary
     * format OR 0x0-0x59 in BCD format. */
    uint8_t minutes;
    /** The hour to set the Calendar time to. Valid values are 0-23 in Binary
     * format OR 0x0-0x23 in BCD format. */
    uint8_t hours;
    /** The day of the week to set the Calendar time to. Valid values are 0-6
     * in Binary format OR 0x0-0x6 in BCD format. */
    uint8_t dayOfWeek;
    /** The day of the month to set the Calendar time to. Valid values are 1-31
     * in Binary format OR 0x1-0x31 in BCD format. */
    uint8_t dayOfMonth;
    /** The month to set the Calendar time to. Valid values are 1-12 in Binary
     * format OR 0x1-0x12 in BCD format. */
    uint8_t month;
    /** The year to set the Calendar time to. Valid values are 0-4095 in Binary
     * format OR 0x0-0x4095 in BCD format. */
    uint16_t year;
} DL_RTC_Calendar;

/**
 *  @brief      Enable power to the RTC module.
 *
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 */
__STATIC_INLINE void DL_RTC_enablePower(RTC_Regs *rtc)
{
    rtc->GPRCM.PWREN = (RTC_PWREN_KEY_UNLOCK_W | RTC_PWREN_ENABLE_ENABLE);
}

/**
 *  @brief      Disable power to the RTC module.
 *
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 */
__STATIC_INLINE void DL_RTC_disablePower(RTC_Regs *rtc)
{
    rtc->GPRCM.PWREN = (RTC_PWREN_KEY_UNLOCK_W | RTC_PWREN_ENABLE_DISABLE);
}

/**
 *  @brief Returns if power is enabled for the RTC module
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return true if power is enabled
 *  @return false if power is disabled
 */
__STATIC_INLINE bool DL_RTC_isPowerEnabled(RTC_Regs *rtc)
{
    return (
        (rtc->GPRCM.PWREN & RTC_PWREN_ENABLE_MASK) == RTC_PWREN_ENABLE_ENABLE);
}

/**
 *  @brief      Resets all registers in the RTC module.
 *
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 */
__STATIC_INLINE void DL_RTC_reset(RTC_Regs *rtc)
{
    rtc->GPRCM.RSTCTL =
        (RTC_RSTCTL_KEY_UNLOCK_W | RTC_RSTCTL_RESETSTKYCLR_CLR |
            RTC_RSTCTL_RESETASSERT_ASSERT);
}

/**
 *  @brief      Returns if the RTC module was reset
 *
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return true if module was reset
 *  @return false if module was not reset
 */
__STATIC_INLINE bool DL_RTC_isReset(RTC_Regs *rtc)
{
    return ((rtc->GPRCM.STAT & RTC_STAT_RESETSTKY_MASK) ==
            RTC_STAT_RESETSTKY_RESET);
}

/**
 *  @brief      Enables the supply of the 32kHz clock to the RTC. It will not
 *              power up the 32kHz crystal oscillator. This needs to be done
 *              in the Clock System Module.
 *
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 */
__STATIC_INLINE void DL_RTC_enableClockControl(RTC_Regs *rtc)
{
    rtc->CLKCTL = RTC_CLKCTL_MODCLKEN_ENABLE;
}

/**
 *  @brief      Disables the supply of the 32kHz clock to the RTC.
 *
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 */
__STATIC_INLINE void DL_RTC_disableClockControl(RTC_Regs *rtc)
{
    rtc->CLKCTL = RTC_CLKCTL_MODCLKEN_DISABLE;
}

/**
 *  @brief      Enables interrupts when the CPU is in debug mode. Interrupt
 *              requests are signaled to the interrupt controller.
 *
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 */
__STATIC_INLINE void DL_RTC_enableDebugInterrupts(RTC_Regs *rtc)
{
    rtc->DBGCTL |= RTC_DBGCTL_DBGINT_ON;
}

/**
 *  @brief      Disables interrupts when the CPU is in debug mode. Interrupts
 *              of the RTC module will not be captured. There will be no
 *              updates to the RTCRIS, RTCMISC and RTCIIDX registers.
 *
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 */
__STATIC_INLINE void DL_RTC_disableDebugInterrupts(RTC_Regs *rtc)
{
    rtc->DBGCTL &= ~(RTC_DBGCTL_DBGINT_MASK);
}

/**
 *  @brief      Enables the RTC modules debug mode.
 *
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 */
__STATIC_INLINE void DL_RTC_enableDebugMode(RTC_Regs *rtc)
{
    rtc->DBGCTL |= RTC_DBGCTL_DBGRUN_RUN;
}

/**
 *  @brief      Disables the RTC modules debug mode.
 *
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 */
__STATIC_INLINE void DL_RTC_disableDebugMode(RTC_Regs *rtc)
{
    rtc->DBGCTL &= ~(RTC_DBGCTL_DBGRUN_MASK);
}

/**
 *  @brief      Set the format of the real-time clock
 *
 * The format must be selected before the time is set.
 *
 *  @param[in]  rtc       Pointer to the register overlay for the RTC peripheral
 *  @param[in]  formatSelect    Selectable format the RTC peripheral will
 *                              provide time in. One of @ref DL_RTC_FORMAT
 */
__STATIC_INLINE void DL_RTC_setClockFormat(
    RTC_Regs *rtc, DL_RTC_FORMAT formatSelect)
{
    rtc->CTL |= (uint32_t) formatSelect;
}

/**
 *  @brief      Get the format currently being used for counting the
 *              real-time clock.
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return            Format for counting the real-time clock.
 *
 *  @retval            One of @ref DL_RTC_FORMAT
 */
__STATIC_INLINE DL_RTC_FORMAT DL_RTC_getClockFormat(RTC_Regs *rtc)
{
    uint32_t format = (rtc->CTL & RTC_CTL_RTCBCD_MASK);

