TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L1306/driverlib/empty_driverlib_src/ti/driverlib/dl_rtc.h
    return (DL_RTC_FORMAT)(format);
}

/**
 *  @brief      Sets the interval alarm event condition
 *
 * The interval alarm can be configured to generate an interval alarm event
 * when one of the following events occurs:
 * - MIN changes
 * - HOUR changes
 * - Every day at midnight (00:00:00)
 * - Every day at noon (12:00:00)
 *
 * The interval alarm sources the @ref DL_RTC_INTERRUPT_INTERVAL_ALARM interrupt
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  alarmEvent  The interval alarm interrupt condition. One of
 *                          @ref DL_RTC_INTERVAL_ALARM
 */
__STATIC_INLINE void DL_RTC_setIntervalAlarm(
    RTC_Regs *rtc, DL_RTC_INTERVAL_ALARM alarmEvent)
{
    DL_Common_updateReg(
        &rtc->CTL, (uint32_t) alarmEvent, RTC_CTL_RTCTEVTX_MASK);
}

/**
 *  @brief      Gets the interval alarm event condition
 *
 * The interval alarm can be configured to generate an interval alarm event
 * when one of the following events occurs:
 * - MIN changes
 * - HOUR changes
 * - Every day at midnight (00:00:00)
 * - Every day at noon (12:00:00)
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return DL_RTC_INTERVAL_ALARM
 */
__STATIC_INLINE DL_RTC_INTERVAL_ALARM DL_RTC_getIntervalAlarm(RTC_Regs *rtc)
{
    uint32_t alarm = (rtc->CTL & RTC_CTL_RTCTEVTX_MASK);

    return (DL_RTC_INTERVAL_ALARM)(alarm);
}

/**
 *  @brief      Checks if RTC is safe for reading
 *
 * This API checks if the counter/calender registers can be safely read.
 *
 * The RTC counter/calendar registers are updated once per second. To prevent
 * reading any counter/calendar register at the time of an update (which could
 * result in an invalid time being read), a keep-out window is provided. The
 * keep-out window is approximately 128/32768 seconds before the counters
 * update.
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return true if RTC is safe for reading
 *  @return false if RTC values are in transition
 *
 */
__STATIC_INLINE bool DL_RTC_isSafetoRead(RTC_Regs *rtc)
{
    return ((rtc->STA & RTC_STA_RTCRDY_MASK) == RTC_STA_RTCRDY_READY);
}

/**
 *  @brief      Checks if RTC is ready to get new calibration values
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return true if RTC can get new calibration values
 *  @return false if RTC is not ready to get new calibration values
 *
 */
__STATIC_INLINE bool DL_RTC_isReadyToCalibrate(RTC_Regs *rtc)
{
    return ((rtc->STA & RTC_STA_RTCTCRDY_MASK) == RTC_STA_RTCTCRDY_READY);
}

/**
 *  @brief      Checks if RTC new calibration values were written OK
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return true if calibration write was successful
 *  @return false if calibration write was unsuccessful
 *
 */
__STATIC_INLINE bool DL_RTC_isCalibrationWriteResultOK(RTC_Regs *rtc)
{
    return ((rtc->STA & RTC_STA_RTCTCOK_MASK) == RTC_STA_RTCTCOK_OK);
}

/**
 *  @brief      Sets output frequency for offset calibration
 *
 * Sets the frequency output to RTC_OUT pin for calibration measurement.
 * The corresponding port must be configured for the peripheral module
 * function.
 *
 *  @param[in]  rtc     Pointer to the register overlay for the RTC peripheral
 *  @param[in]  offsetFrequency   The frequency of offset calibration.
 *                                Valid values are one of
 *                                @ref DL_RTC_OFFSET_CALIBRATION_FREQUENCY
 */
__STATIC_INLINE void DL_RTC_setOffsetCalibrationFrequency(
    RTC_Regs *rtc, DL_RTC_OFFSET_CALIBRATION_FREQUENCY offsetFrequency)
{
    DL_Common_updateReg(
        &rtc->CAL, (uint32_t) offsetFrequency, RTC_CAL_RTCCALFX_MASK);
}

/**
 *  @brief      Sets the offset error calibration adjustment value.
 *
 * Each LSB represents approximately +1ppm (RTCOCALXS = 1) or
 * -1ppm (RTCOCALXS = 0) adjustment in frequency. Maximum effective calibration
 * value is +/-240ppm.
 * Excess values written above +/-240ppm will be ignored by hardware.
 *
 *  @param[in]  rtc     Pointer to the register overlay for the RTC peripheral
 *  @param[in]  offsetSign        The sign of offset calibration.
 *                                Valid values are one of
 *                                @ref DL_RTC_OFFSET_CALIBRATION_SIGN
 *  @param[in]  offsetValue       The value that the offset will be a factor of.
 *                                Must be any integer from 1-240.
 */
__STATIC_INLINE void DL_RTC_setOffsetCalibrationAdjValue(RTC_Regs *rtc,
    DL_RTC_OFFSET_CALIBRATION_SIGN offsetSign, uint8_t offsetValue)
{
    DL_Common_updateReg(&rtc->CAL,
        ((uint32_t) offsetSign | (uint32_t) offsetValue),
        (RTC_CAL_RTCOCALX_MASK | RTC_CAL_RTCOCALS_MASK));
}

/**
 *  @brief      Sets the offset error calibration.
 *
 * Each LSB represents approximately +1ppm (RTCOCALXS = 1) or
 * -1ppm (RTCOCALXS = 0) adjustment in frequency. Maximum effective calibration
 * value is +/-240ppm.
 * Excess values written above +/-240ppm will be ignored by hardware.
 *
 * Sets the frequency output to RTCCLK pin for calibration measurement.
 * The corresponding port must be configured for the peripheral module
 * function.
 *
 *  @param[in]  rtc     Pointer to the register overlay for the RTC peripheral
 *  @param[in]  offsetFrequency   The frequency of offset calibration.
 *                                Valid values are one of
 *                                @ref DL_RTC_OFFSET_CALIBRATION_FREQUENCY
 *  @param[in]  offsetSign        The sign of offset calibration.
 *                                Valid values are one of
 *                                @ref DL_RTC_OFFSET_CALIBRATION_SIGN
 *  @param[in]  offsetValue       The value that the offset will be a factor of.
 *                                Must be any integer from 1-240.
 */
__STATIC_INLINE void DL_RTC_setOffsetCalibration(RTC_Regs *rtc,
    DL_RTC_OFFSET_CALIBRATION_FREQUENCY offsetFrequency,
    DL_RTC_OFFSET_CALIBRATION_SIGN offsetSign, uint8_t offsetValue)
{
    rtc->CAL = (offsetValue & RTC_CAL_RTCOCALX_MASK) |
               (uint32_t) offsetFrequency | (uint32_t) offsetSign;
}

/**
 *  @brief      Gets the offset calibration frequency.
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return            Frequency used in offset calibration.
 *
 *  @retval            One of @ref DL_RTC_OFFSET_CALIBRATION_FREQUENCY
 */
__STATIC_INLINE DL_RTC_OFFSET_CALIBRATION_FREQUENCY
DL_RTC_getOffsetCalibrationFrequency(RTC_Regs *rtc)
{
    uint32_t freq = (rtc->CAL & RTC_CAL_RTCCALFX_MASK);

