TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L1306/driverlib/empty_driverlib_src/ti/driverlib/dl_rtc.h
    return (DL_RTC_OFFSET_CALIBRATION_FREQUENCY)(freq);
}

/**
 *  @brief      Gets the offset calibration sign.
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return            Sign used in offset calibration.
 *
 *  @retval            One of @ref DL_RTC_OFFSET_CALIBRATION_SIGN
 */
__STATIC_INLINE DL_RTC_OFFSET_CALIBRATION_SIGN DL_RTC_getOffsetCalibrationSign(
    RTC_Regs *rtc)
{
    uint32_t sign = (rtc->CAL & RTC_CAL_RTCOCALS_MASK);

    return (DL_RTC_OFFSET_CALIBRATION_SIGN)(sign);
}

/**
 *  @brief      Gets the offset error calibration value.
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return            Offset value used in offset calibration.
 *
 *  @retval            0 - 240  The effective offset error calibration.
 */
__STATIC_INLINE uint32_t DL_RTC_getOffsetCalibrationValue(RTC_Regs *rtc)
{
    return (rtc->CAL & RTC_CAL_RTCOCALX_MASK);
}

/**
 *  @brief      Set the specified RTC temperature compensation.
 *
 *  This function sets the calibration offset to make the RTC as accurate as
 *  possible. The offsetDirection can be either +1-ppm or -1-ppm, and the
 *  offsetValue should be from 1-240 and is multiplied by the direction setting
 *  (i.e. +1-ppm * 8 (offsetValue) = +8-ppm).
 *
 *  @param[in]  rtc               Pointer to the register overlay for the RTC
 *                                peripheral
 *  @param[in]  offsetDirection   The direction that the calibration offset
 *                                will go. Valid values are one of
 *                                @ref DL_RTC_TEMP_CALIBRATION
 *  @param[in]  offsetValue       The value that the offset will be a factor of.
 *                                Must be any integer from 1-240.
 */
__STATIC_INLINE void DL_RTC_setTemperatureCompensation(RTC_Regs *rtc,
    DL_RTC_TEMP_CALIBRATION offsetDirection, uint32_t offsetValue)
{
    rtc->TCMP =
        (offsetValue & RTC_TCMP_RTCTCMPX_MASK) | (uint32_t) offsetDirection;
}

/**
 *  @brief      Get the RTC temperature compensation.
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return            The cumulative temperature compensation
 *
 *  @retval            Signed addition of RTCOCALX and RTCTCMPX values, and
 *                     the updated sign bit (RTCTCMPS) of the addition result.
 *
 */
__STATIC_INLINE uint32_t DL_RTC_getTemperatureCompensation(RTC_Regs *rtc)
{
    return (rtc->TCMP);
}

/**
 *  @brief      Set the seconds in BCD in the RTC calendar
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  seconds    Value for the seconds of the RTC calendar
 *                         Valid values are 0x0-0x59.
 */
__STATIC_INLINE void DL_RTC_setCalendarSecondsBCD(
    RTC_Regs *rtc, uint8_t seconds)
{
    rtc->SEC = ((uint32_t) seconds << RTC_SEC_SECLOWBCD_OFS) &
               (RTC_SEC_SECLOWBCD_MASK | RTC_SEC_SECHIGHBCD_MASK);
}

/**
 *  @brief      Get the seconds in in BCD the RTC calendar
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_isSafetoRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The seconds in the RTC calendar
 *
 *  @retval            Value in range: 0x0-0x59
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getCalendarSecondsBCD(RTC_Regs *rtc)
{
    return (uint8_t)(
        (rtc->SEC & (RTC_SEC_SECLOWBCD_MASK | RTC_SEC_SECHIGHBCD_MASK)) >>
        RTC_SEC_SECLOWBCD_OFS);
}

/**
 *  @brief      Set the minutes in in BCD the RTC calendar
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  minutes    Value for the minutes of the RTC calendar
 *                         Valid values are 0x0-0x59.
 */
__STATIC_INLINE void DL_RTC_setCalendarMinutesBCD(
    RTC_Regs *rtc, uint8_t minutes)
{
    rtc->MIN = ((uint32_t) minutes << RTC_MIN_MINLOWBCD_OFS) &
               (RTC_MIN_MINLOWBCD_MASK | RTC_MIN_MINHIGHBCD_MASK);
}

/**
 *  @brief      Get the minutes in in BCD the RTC calendar
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_isSafetoRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The minutes in the RTC calendar
 *
 *  @retval            Value in range: 0x0-0x59
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getCalendarMinutesBCD(RTC_Regs *rtc)
{
    return (uint8_t)(
        (rtc->MIN & (RTC_MIN_MINLOWBCD_MASK | RTC_MIN_MINHIGHBCD_MASK)) >>
        RTC_MIN_MINLOWBCD_OFS);
}

/**
 *  @brief      Set the hours in in BCD the RTC calendar
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  hours    Value for the hours of the RTC calendar
 *                       Valid values are 0x0-0x23
 */
__STATIC_INLINE void DL_RTC_setCalendarHoursBCD(RTC_Regs *rtc, uint8_t hours)
{
    rtc->HOUR = ((uint32_t) hours << RTC_HOUR_HOURLOWBCD_OFS) &
                (RTC_HOUR_HOURLOWBCD_MASK | RTC_HOUR_HOURHIGHBCD_MASK);
}

/**
 *  @brief      Get the hours in in BCD the RTC calendar
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_isSafetoRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The hours in the RTC calendar
 *
 *  @retval            Value in range: 0x0-0x23
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getCalendarHoursBCD(RTC_Regs *rtc)
{
    return (uint8_t)(
        (rtc->HOUR & (RTC_HOUR_HOURLOWBCD_MASK | RTC_HOUR_HOURHIGHBCD_MASK)) >>
        RTC_HOUR_HOURLOWBCD_OFS);
}

/**
 *  @brief      Set the day of the week in BCD in the RTC calendar
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  day    Value for the day of the week of the RTC calendar
 *                     Valid values are 0x0-0x6
 */
__STATIC_INLINE void DL_RTC_setCalendarDayOfWeekBCD(RTC_Regs *rtc, uint8_t day)
{
    DL_Common_updateReg(&rtc->DAY, day, RTC_DAY_DOW_MASK);
}

/**
 *  @brief      Get the day of the week in BCD in the RTC calendar
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_isSafetoRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The day of the week in the RTC calendar
 *
 *  @retval            Value in range: 0x0-0x6
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getCalendarDayOfWeekBCD(RTC_Regs *rtc)
{
    return (uint8_t)(rtc->DAY & RTC_DAY_DOW_MASK);
}

/**
 *  @brief      Set the day of the month in BCD in the RTC calendar
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  day    Value for the day of the month of the RTC calendar
 *                     Valid values are 0x1-0x31
 */
__STATIC_INLINE void DL_RTC_setCalendarDayOfMonthBCD(
    RTC_Regs *rtc, uint8_t day)
{
    DL_Common_updateReg(&rtc->DAY, (uint32_t) day << RTC_DAY_DOMLOWBCD_OFS,
        (RTC_DAY_DOMLOWBCD_MASK | RTC_DAY_DOMHIGHBCD_MASK));
}

/**
 *  @brief      Get the day of the month in BCD in the RTC calendar
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_isSafetoRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The day of the month in the RTC calendar
 *
 *  @retval            Value in range: 0x1-0x31
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getCalendarDayOfMonthBCD(RTC_Regs *rtc)
{
    return (uint8_t)(
        (rtc->DAY & (RTC_DAY_DOMLOWBCD_MASK | RTC_DAY_DOMHIGHBCD_MASK)) >>
        RTC_DAY_DOMLOWBCD_OFS);
}

/**
 *  @brief      Set the month in in BCD the RTC calendar
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  month    Value for the month of the RTC calendar
 *                       Valid values are 0x1-0x12
 */
__STATIC_INLINE void DL_RTC_setCalendarMonthBCD(RTC_Regs *rtc, uint8_t month)
{
    rtc->MON = ((uint32_t) month << RTC_MON_MONLOWBCD_OFS) &
               (RTC_MON_MONLOWBCD_MASK | RTC_MON_MONHIGHBCD_MASK);
}

/**
 *  @brief      Get the month of the year in BCD in the RTC calendar
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_isSafetoRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The month of the year in the RTC calendar
 *
 *  @retval            Value in range: 0x1-0x12
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getCalendarMonthBCD(RTC_Regs *rtc)
{
    return (uint8_t)(
        (rtc->MON & (RTC_MON_MONLOWBCD_MASK | RTC_MON_MONHIGHBCD_MASK)) >>
        RTC_MON_MONLOWBCD_OFS);
}

/**
 *  @brief      Set the year in in BCD the RTC calendar
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  year    Value for the year of the RTC calendar
 *                      Valid values are 0x0-0x4095
 */
__STATIC_INLINE void DL_RTC_setCalendarYearBCD(RTC_Regs *rtc, uint16_t year)
{
    rtc->YEAR = ((uint32_t) year << RTC_YEAR_YEARLOWESTBCD_OFS) &
                (RTC_YEAR_YEARLOWESTBCD_MASK | RTC_YEAR_DECADEBCD_MASK |
                    RTC_YEAR_CENTLOWBCD_MASK | RTC_YEAR_CENTHIGHBCD_MASK);
}

/**
 *  @brief      Get the year in in BCD the RTC calendar
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_isSafetoRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The year in the RTC calendar
 *
 *  @retval            Value in range: 0x0-0x4095
 *
 */
__STATIC_INLINE uint16_t DL_RTC_getCalendarYearBCD(RTC_Regs *rtc)
{
    return (uint16_t)(
        (rtc->YEAR &
            (RTC_YEAR_YEARLOWESTBCD_MASK | RTC_YEAR_DECADEBCD_MASK |
                RTC_YEAR_CENTLOWBCD_MASK | RTC_YEAR_CENTHIGHBCD_MASK)) >>
        RTC_YEAR_YEARLOWESTBCD_OFS);
}

/**
 *  @brief      Enable minutes in BCD for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_enableAlarm1MinutesBCD(RTC_Regs *rtc)
{
    rtc->A1MIN |= RTC_A1MIN_AMINAEBCD_ENABLE;
}

/**
 *  @brief      Disable minutes in BCD for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_disableAlarm1MinutesBCD(RTC_Regs *rtc)
{
    rtc->A1MIN &= ~(RTC_A1MIN_AMINAEBCD_MASK);
}

/**
 *  @brief      Set the minutes in BCD for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  minutes    Value for the minutes of alarm 1
 *                         Valid values are 0x0-0x59
 *
 */
__STATIC_INLINE void DL_RTC_setAlarm1MinutesBCD(RTC_Regs *rtc, uint8_t minutes)
{
    rtc->A1MIN = ((uint32_t) minutes << RTC_A1MIN_AMINLOWBCD_OFS) &
                 (RTC_A1MIN_AMINLOWBCD_MASK | RTC_A1MIN_AMINHIGHBCD_MASK);
}

/**
 *  @brief      Get the minutes in BCD for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return            The minutes of alarm 1
 *
 *  @retval            Value in range: 0x0-0x59
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getAlarm1MinutesBCD(RTC_Regs *rtc)
{
    return (uint8_t)((rtc->A1MIN & (RTC_A1MIN_AMINLOWBCD_MASK |
                                       RTC_A1MIN_AMINHIGHBCD_MASK)) >>
                     RTC_A1MIN_AMINLOWBCD_OFS);
}

/**
 *  @brief      Enable hours in BCD for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_enableAlarm1HoursBCD(RTC_Regs *rtc)
{
    rtc->A1HOUR |= RTC_A1HOUR_AHOURAEBIN_ENABLE;
}

/**
 *  @brief      Disable hours in BCD for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_disableAlarm1HoursBCD(RTC_Regs *rtc)
{
    rtc->A1HOUR &= ~(RTC_A1HOUR_AHOURAEBIN_MASK);
}

/**
 *  @brief      Set the hours in BCD for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  hours    Value for the hours of alarm 1
 *                       Valid values are 0x0-0x23
 */
__STATIC_INLINE void DL_RTC_setAlarm1HoursBCD(RTC_Regs *rtc, uint8_t hours)
{
    rtc->A1HOUR = ((uint32_t) hours << RTC_A1HOUR_AHOURLOWBCD_OFS) &
                  (RTC_A1HOUR_AHOURLOWBCD_MASK | RTC_A1HOUR_AHOURHIGHBCD_MASK);
}

/**
 *  @brief      Get the hours in BCD for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return            The hours of alarm 1
 *
 *  @retval            Value in range: 0x0-0x23
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getAlarm1HoursBCD(RTC_Regs *rtc)
{
    return (uint8_t)((rtc->A1HOUR & (RTC_A1HOUR_AHOURLOWBCD_MASK |
                                        RTC_A1HOUR_AHOURHIGHBCD_MASK)) >>
                     RTC_A1HOUR_AHOURLOWBCD_OFS);
}

/**
 *  @brief      Enable day of the week in BCD for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_enableAlarm1DayOfWeekBCD(RTC_Regs *rtc)
{
    rtc->A1DAY |= RTC_A1DAY_ADOWAE_ENABLE;
}

/**
 *  @brief      Disable day of the week in BCD for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_disableAlarm1DayOfWeekBCD(RTC_Regs *rtc)
{
    rtc->A1DAY &= ~(RTC_A1DAY_ADOWAE_MASK);
}

/**
 *  @brief      Set the day of the week in BCD for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  day    Value for the day of the week of the RTC calendar
 *                     Valid values are 0x0-0x6
 */
__STATIC_INLINE void DL_RTC_setAlarm1DayOfWeekBCD(RTC_Regs *rtc, uint8_t day)
{
    DL_Common_updateReg(&rtc->A1DAY, day, RTC_A1DAY_ADOW_MASK);
}

/**
 *  @brief      Get the day of the week in BCD for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return            The day of the week in the RTC calendar
 *
 *  @retval            Value in range: 0x0-0x6
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getAlarm1DayOfWeekBCD(RTC_Regs *rtc)
{
    return (uint8_t)(rtc->DAY & RTC_A1DAY_ADOW_MASK);
}

/**
 *  @brief      Enable day of the month in BCD for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_enableAlarm1DayOfMonthBCD(RTC_Regs *rtc)
{
    rtc->A1DAY |= RTC_A1DAY_ADOMAEBCD_ENABLE;
}

/**
 *  @brief      Disable day of the month in BCD for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_disableAlarm1DayOfMonthBCD(RTC_Regs *rtc)
{
    rtc->A1DAY &= ~(RTC_A1DAY_ADOMAEBCD_MASK);
}

/**
 *  @brief      Set the day of the month in BCD for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  day    Value for the day of the month of the RTC calendar
 *                     Valid values are 0x1-0x31
 */
__STATIC_INLINE void DL_RTC_setAlarm1DayOfMonthBCD(RTC_Regs *rtc, uint8_t day)
{
    DL_Common_updateReg(&rtc->A1DAY,
        (uint32_t) day << RTC_A1DAY_ADOMLOWBCD_OFS,
        (RTC_A1DAY_ADOMLOWBCD_MASK | RTC_A1DAY_ADOMHIGHBCD_MASK));
}

/**
 *  @brief      Get the day of the month in BCD for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return            The day of the month in the RTC calendar
 *
 *  @retval            Value in range: 0x1-0x31
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getAlarm1DayOfMonthBCD(RTC_Regs *rtc)
{
    return (uint8_t)((rtc->A1DAY & (RTC_A1DAY_ADOMLOWBCD_MASK |
                                       RTC_A1DAY_ADOMHIGHBCD_MASK)) >>
                     RTC_A1DAY_ADOMLOWBCD_OFS);
}

/**
 *  @brief      Enable minutes in BCD for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_enableAlarm2MinutesBCD(RTC_Regs *rtc)
{
    rtc->A2MIN |= RTC_A2MIN_AMINAEBCD_ENABLE;
}

/**
 *  @brief      Disable minutes in BCD for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_disableAlarm2MinutesBCD(RTC_Regs *rtc)
{
    rtc->A2MIN &= ~(RTC_A2MIN_AMINAEBCD_MASK);
}

/**
 *  @brief      Set the minutes in BCD for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  minutes    Value for the minutes of alarm 2
 *                         Valid values are 0x0-0x59
 *
 */
__STATIC_INLINE void DL_RTC_setAlarm2MinutesBCD(RTC_Regs *rtc, uint8_t minutes)
{
    rtc->A2MIN = ((uint32_t) minutes << RTC_A2MIN_AMINLOWBCD_OFS) &
                 (RTC_A2MIN_AMINLOWBCD_MASK | RTC_A2MIN_AMINHIGHBCD_MASK);
}

/**
 *  @brief      Get the minutes in BCD for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return            The minutes of alarm 2
 *
 *  @retval            Value in range: 0x0-0x59
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getAlarm2MinutesBCD(RTC_Regs *rtc)
{
    return (uint8_t)((rtc->A2MIN & (RTC_A2MIN_AMINLOWBCD_MASK |
                                       RTC_A2MIN_AMINHIGHBCD_MASK)) >>
                     RTC_A2MIN_AMINLOWBCD_OFS);
}

/**
 *  @brief      Enable hours in BCD for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_enableAlarm2HoursBCD(RTC_Regs *rtc)
{
    rtc->A2HOUR |= RTC_A2HOUR_AHOURAEBIN_ENABLE;
}

/**
 *  @brief      Disable hours in BCD for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_disableAlarm2HoursBCD(RTC_Regs *rtc)
{
    rtc->A2HOUR &= ~(RTC_A2HOUR_AHOURAEBIN_MASK);
}

/**
 *  @brief      Set the hours in BCD for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  hours    Value for the hours of alarm 2
 *                       Valid values are 0x0-0x23
 */
__STATIC_INLINE void DL_RTC_setAlarm2HoursBCD(RTC_Regs *rtc, uint8_t hours)
{
    rtc->A2HOUR = ((uint32_t) hours << RTC_A2HOUR_AHOURLOWBCD_OFS) &
                  (RTC_A2HOUR_AHOURLOWBCD_MASK | RTC_A2HOUR_AHOURHIGHBCD_MASK);
}

/**
 *  @brief      Get the hours in BCD for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return            The hours of alarm 2
 *
 *  @retval            Value in range: 0x0-0x23
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getAlarm2HoursBCD(RTC_Regs *rtc)
{
    return (uint8_t)((rtc->A2HOUR & (RTC_A2HOUR_AHOURLOWBCD_MASK |
                                        RTC_A2HOUR_AHOURHIGHBCD_MASK)) >>
                     RTC_A2HOUR_AHOURLOWBCD_OFS);
}

/**
 *  @brief      Enable day of the week in BCD for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_enableAlarm2DayOfWeekBCD(RTC_Regs *rtc)
{
    rtc->A2DAY |= RTC_A2DAY_ADOWAE_ENABLE;
}

/**
 *  @brief      Disable day of the week in BCD for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_disableAlarm2DayOfWeekBCD(RTC_Regs *rtc)
{
    rtc->A2DAY &= ~(RTC_A2DAY_ADOWAE_MASK);
}

/**
 *  @brief      Set the day of the week in BCD for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  day    Value for the day of the week of the RTC calendar
 *                     Valid values are 0x0-0x6
 */
__STATIC_INLINE void DL_RTC_setAlarm2DayOfWeekBCD(RTC_Regs *rtc, uint8_t day)
{
    DL_Common_updateReg(&rtc->A2DAY, day, RTC_A2DAY_ADOW_MASK);
}

/**
 *  @brief      Get the day of the week in BCD for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return            The day of the week in the RTC calendar
 *
 *  @retval            Value in range: 0x0-0x6
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getAlarm2DayOfWeekBCD(RTC_Regs *rtc)
{
    return (uint8_t)(rtc->DAY & RTC_A2DAY_ADOW_MASK);
}

/**
 *  @brief      Enable day of the month in BCD for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_enableAlarm2DayOfMonthBCD(RTC_Regs *rtc)
{
    rtc->A2DAY |= RTC_A2DAY_ADOMAEBCD_ENABLE;
}

/**
 *  @brief      Disable day of the month in BCD for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_disableAlarm2DayOfMonthBCD(RTC_Regs *rtc)
{
    rtc->A2DAY &= ~(RTC_A2DAY_ADOMAEBCD_MASK);
}

/**
 *  @brief      Set the day of the month in BCD for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  day    Value for the day of the month of the RTC calendar
 *                     Valid values are 0x1-0x31
 */
__STATIC_INLINE void DL_RTC_setAlarm2DayOfMonthBCD(RTC_Regs *rtc, uint8_t day)
{
    DL_Common_updateReg(&rtc->A2DAY,
        (uint32_t) day << RTC_A2DAY_ADOMLOWBCD_OFS,
        (RTC_A2DAY_ADOMLOWBCD_MASK | RTC_A2DAY_ADOMHIGHBCD_MASK));
}

/**
 *  @brief      Get the day of the month in BCD for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return            The day of the month in the RTC calendar
 *
 *  @retval            Value in range: 0x1-0x31
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getAlarm2DayOfMonthBCD(RTC_Regs *rtc)
{
    return (uint8_t)((rtc->A2DAY & (RTC_A2DAY_ADOMLOWBCD_MASK |
                                       RTC_A2DAY_ADOMHIGHBCD_MASK)) >>
                     RTC_A2DAY_ADOMLOWBCD_OFS);
}

