TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L1306/driverlib/empty_driverlib_src/ti/driverlib/dl_rtc.h
/**
 *  @brief      Set the seconds in binary the RTC calendar
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  seconds    Value for the seconds of the RTC calendar
 *                         Valid values are 0-59
 */
__STATIC_INLINE void DL_RTC_setCalendarSecondsBinary(
    RTC_Regs *rtc, uint8_t seconds)
{
    rtc->SEC = (seconds & RTC_SEC_SECBIN_MASK);
}

/**
 *  @brief      Get the seconds in binary in the RTC calendar
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_isSafetoRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The seconds in the RTC calendar
 *
 *  @retval            Value in range: 0-59
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getCalendarSecondsBinary(RTC_Regs *rtc)
{
    return (uint8_t)(rtc->SEC & RTC_SEC_SECBIN_MASK);
}

/**
 *  @brief      Set the minutes in binary in the RTC calendar
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  minutes    Value for the minutes of the RTC calendar
 *                         Valid values are 0-59
 */
__STATIC_INLINE void DL_RTC_setCalendarMinutesBinary(
    RTC_Regs *rtc, uint8_t minutes)
{
    rtc->MIN = (minutes & RTC_MIN_MINBIN_MASK);
}

/**
 *  @brief      Get the minutes in binary in the RTC calendar
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_isSafetoRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The minutes in the RTC calendar
 *
 *  @retval            Value in range: 0-59
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getCalendarMinutesBinary(RTC_Regs *rtc)
{
    return (uint8_t)(rtc->MIN & RTC_MIN_MINBIN_MASK);
}

/**
 *  @brief      Set the hours in binary in the RTC calendar
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  hours    Value for the hours of the RTC calendar
 *                       Valid values are 0-23
 */
__STATIC_INLINE void DL_RTC_setCalendarHoursBinary(
    RTC_Regs *rtc, uint8_t hours)
{
    rtc->HOUR = (hours & RTC_HOUR_HOURBIN_MASK);
}

/**
 *  @brief      Get the hours in binary in the RTC calendar
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_isSafetoRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The hours in the RTC calendar
 *
 *  @retval            Value in range: 0-23
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getCalendarHoursBinary(RTC_Regs *rtc)
{
    return (uint8_t)(rtc->HOUR & RTC_HOUR_HOURBIN_MASK);
}

/**
 *  @brief      Set the day of the week in binary in the RTC calendar
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  day    Value for the day of the week of the RTC calendar
 *                     Valid values are 0-6
 */
__STATIC_INLINE void DL_RTC_setCalendarDayOfWeekBinary(
    RTC_Regs *rtc, uint8_t day)
{
    DL_Common_updateReg(&rtc->DAY, day, RTC_DAY_DOW_MASK);
}

/**
 *  @brief      Get the day of the week in binary in the RTC calendar
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_isSafetoRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The day of the week in the RTC calendar
 *
 *  @retval            Value in range: 0-6
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getCalendarDayOfWeekBinary(RTC_Regs *rtc)
{
    return (uint8_t)(rtc->DAY & RTC_DAY_DOW_MASK);
}

/**
 *  @brief      Set the day of the month in binary in the RTC calendar
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  day    Value for the day of the month of the RTC calendar
 *                     Valid values are 1-31
 */
__STATIC_INLINE void DL_RTC_setCalendarDayOfMonthBinary(
    RTC_Regs *rtc, uint8_t day)
{
    DL_Common_updateReg(
        &rtc->DAY, (uint32_t) day << RTC_DAY_DOMBIN_OFS, RTC_DAY_DOMBIN_MASK);
}

/**
 *  @brief      Get the day of the month in binary in the RTC calendar
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_isSafetoRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The day of the month in the RTC calendar
 *
 *  @retval            Value in range: 1-31
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getCalendarDayOfMonthBinary(RTC_Regs *rtc)
{
    return (uint8_t)((rtc->DAY & RTC_DAY_DOMBIN_MASK) >> RTC_DAY_DOMBIN_OFS);
}

/**
 *  @brief      Set the month in binary in the RTC calendar
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  month    Value for the month of the RTC calendar
 *                       Valid values are 1-12
 */
__STATIC_INLINE void DL_RTC_setCalendarMonthBinary(
    RTC_Regs *rtc, uint8_t month)
{
    rtc->MON = (month & RTC_MON_MONBIN_MASK);
}

/**
 *  @brief      Get the month of the year in binary in the RTC calendar
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_isSafetoRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The month of the year in the RTC calendar
 *
 *  @retval            Value in range: 1-12
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getCalendarMonthBinary(RTC_Regs *rtc)
{
    return (uint8_t)(rtc->MON & RTC_MON_MONBIN_MASK);
}

/**
 *  @brief      Set the year in binary in the RTC calendar
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  year    Value for the year of the RTC calendar
 *                      Valid values are 0-4095
 */
__STATIC_INLINE void DL_RTC_setCalendarYearBinary(RTC_Regs *rtc, uint16_t year)
{
    rtc->YEAR = ((uint32_t) year &
                 (RTC_YEAR_YEARLOWBIN_MASK | RTC_YEAR_YEARHIGHBIN_MASK));
}

/**
 *  @brief      Get the year in binary in the RTC calendar
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_isSafetoRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The year in the RTC calendar
 *
 *  @retval            Value in range: 0-4095
 *
 */
__STATIC_INLINE uint16_t DL_RTC_getCalendarYearBinary(RTC_Regs *rtc)
{
    return (uint16_t)(
        rtc->YEAR & (RTC_YEAR_YEARLOWBIN_MASK | RTC_YEAR_YEARHIGHBIN_MASK));
}

/**
 *  @brief      Enable minutes in binary in binary for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_enableAlarm1MinutesBinary(RTC_Regs *rtc)
{
    rtc->A1MIN |= RTC_A1MIN_AMINAEBIN_ENABLE;
}

/**
 *  @brief      Disable minutes in binary for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_disableAlarm1MinutesBinary(RTC_Regs *rtc)
{
    rtc->A1MIN &= ~(RTC_A1MIN_AMINAEBIN_MASK);
}

/**
 *  @brief      Set the minutes in binary for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  minutes    Value for the minutes of alarm 1
 *                         Valid values are 0-59
 *
 */
__STATIC_INLINE void DL_RTC_setAlarm1MinutesBinary(
    RTC_Regs *rtc, uint8_t minutes)
{
    rtc->A1MIN = (minutes & RTC_A1MIN_AMINBIN_MASK);
}

/**
 *  @brief      Get the minutes in binary for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return            The minutes of alarm 1
 *
 *  @retval            Value in range: 0-59
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getAlarm1MinutesBinary(RTC_Regs *rtc)
{
    return (uint8_t)(rtc->A1MIN & RTC_A1MIN_AMINBIN_MASK);
}

/**
 *  @brief      Enable hours in binary for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_enableAlarm1HoursBinary(RTC_Regs *rtc)
{
    rtc->A1HOUR |= RTC_A1HOUR_AHOURAEBIN_ENABLE;
}

/**
 *  @brief      Disable hours in binary for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_disableAlarm1HoursBinary(RTC_Regs *rtc)
{
    rtc->A1HOUR &= ~(RTC_A1HOUR_AHOURAEBIN_MASK);
}

/**
 *  @brief      Set the hours in binary for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  hours    Value for the hours of alarm 1
 *                       Valid values are 0-23
 */
__STATIC_INLINE void DL_RTC_setAlarm1HoursBinary(RTC_Regs *rtc, uint8_t hours)
{
    rtc->A1HOUR = (hours & RTC_A1HOUR_AHOURBIN_MASK);
}

/**
 *  @brief      Get the hours in binary for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return            The hours of alarm 1
 *
 *  @retval            Value in range: 0-23
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getAlarm1HoursBinary(RTC_Regs *rtc)
{
    return (uint8_t)(rtc->A1HOUR & RTC_A1HOUR_AHOURBIN_MASK);
}

/**
 *  @brief      Enable day of the week in binary for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_enableAlarm1DayOfWeekBinary(RTC_Regs *rtc)
{
    rtc->A1DAY |= RTC_A1DAY_ADOWAE_ENABLE;
}

/**
 *  @brief      Disable day of the week in binary for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_disableAlarm1DayOfWeekBinary(RTC_Regs *rtc)
{
    rtc->A1DAY &= ~(RTC_A1DAY_ADOWAE_MASK);
}

/**
 *  @brief      Set the day of the week in binary for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  day    Value for the day of the week of the RTC calendar
 *                     Valid values are 0-6
 */
__STATIC_INLINE void DL_RTC_setAlarm1DayOfWeekBinary(
    RTC_Regs *rtc, uint8_t day)
{
    DL_Common_updateReg(&rtc->A1DAY, day, RTC_A1DAY_ADOW_MASK);
}

/**
 *  @brief      Get the day of the week in binary for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return            The day of the week in the RTC calendar
 *
 *  @retval            Value in range: 0-6
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getAlarm1DayOfWeekBinary(RTC_Regs *rtc)
{
    return (uint8_t)(rtc->A1DAY & RTC_A1DAY_ADOW_MASK);
}

/**
 *  @brief      Enable day of the month in binary for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_enableAlarm1DayOfMonthBinary(RTC_Regs *rtc)
{
    rtc->A1DAY |= RTC_A1DAY_ADOMAEBIN_ENABLE;
}

/**
 *  @brief      Disable day of the month in binary for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_disableAlarm1DayOfMonthBinary(RTC_Regs *rtc)
{
    rtc->A1DAY &= ~(RTC_A1DAY_ADOMAEBIN_MASK);
}

/**
 *  @brief      Set the day of the month in binary for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  day    Value for the day of the month of the RTC calendar
 *                     Valid values are 1-31
 */
__STATIC_INLINE void DL_RTC_setAlarm1DayOfMonthBinary(
    RTC_Regs *rtc, uint8_t day)
{
    DL_Common_updateReg(&rtc->A1DAY, (uint32_t) day << RTC_A1DAY_ADOMBIN_OFS,
        RTC_A1DAY_ADOMBIN_MASK);
}

/**
 *  @brief      Get the day of the month in binary for RTC Calendar Alarm 1
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return            The day of the month in the RTC calendar
 *
 *  @retval            Value in range: 1-31
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getAlarm1DayOfMonthBinary(RTC_Regs *rtc)
{
    return (uint8_t)(
        (rtc->A1DAY & RTC_A1DAY_ADOMBIN_MASK) >> RTC_A1DAY_ADOMBIN_OFS);
}

/**
 *  @brief      Enable minutes in binary for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_enableAlarm2MinutesBinary(RTC_Regs *rtc)
{
    rtc->A2MIN |= RTC_A2MIN_AMINAEBIN_ENABLE;
}

/**
 *  @brief      Disable minutes in binary for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_disableAlarm2MinutesBinary(RTC_Regs *rtc)
{
    rtc->A2MIN &= ~(RTC_A2MIN_AMINAEBIN_MASK);
}

/**
 *  @brief      Set the minutes in binary for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  minutes    Value for the minutes of alarm 2
 *                         Valid values are 0-59
 *
 */
__STATIC_INLINE void DL_RTC_setAlarm2MinutesBinary(
    RTC_Regs *rtc, uint8_t minutes)
{
    rtc->A2MIN = (minutes & RTC_A2MIN_AMINBIN_MASK);
}

/**
 *  @brief      Get the minutes in binary for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return            The minutes of alarm 2
 *
 *  @retval            Value in range: 0-59
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getAlarm2MinutesBinary(RTC_Regs *rtc)
{
    return (uint8_t)(rtc->A2MIN & RTC_A2MIN_AMINBIN_MASK);
}

/**
 *  @brief      Enable hours in binary for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_enableAlarm2HoursBinary(RTC_Regs *rtc)
{
    rtc->A2HOUR |= RTC_A2HOUR_AHOURAEBIN_ENABLE;
}

/**
 *  @brief      Disable hours in binary for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_disableAlarm2HoursBinary(RTC_Regs *rtc)
{
    rtc->A2HOUR &= ~(RTC_A2HOUR_AHOURAEBIN_MASK);
}

/**
 *  @brief      Set the hours in binary for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  hours    Value for the hours of alarm 2
 *                       Valid values are 0-23
 */
__STATIC_INLINE void DL_RTC_setAlarm2HoursBinary(RTC_Regs *rtc, uint8_t hours)
{
    rtc->A2HOUR = (hours & RTC_A2HOUR_AHOURBIN_MASK);
}

/**
 *  @brief      Get the hours in binary for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return            The hours of alarm 2
 *
 *  @retval            Value in range: 0-23
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getAlarm2HoursBinary(RTC_Regs *rtc)
{
    return (uint8_t)(rtc->A2HOUR & RTC_A2HOUR_AHOURBIN_MASK);
}

/**
 *  @brief      Enable day of the week in binary for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_enableAlarm2DayOfWeekBinary(RTC_Regs *rtc)
{
    rtc->A2DAY |= RTC_A2DAY_ADOWAE_ENABLE;
}

/**
 *  @brief      Disable day of the week in binary for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_disableAlarm2DayOfWeekBinary(RTC_Regs *rtc)
{
    rtc->A2DAY &= ~(RTC_A2DAY_ADOWAE_MASK);
}

/**
 *  @brief      Set the day of the week in binary for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  day    Value for the day of the week of the RTC calendar
 *                     Valid values are 0-6
 */
__STATIC_INLINE void DL_RTC_setAlarm2DayOfWeekBinary(
    RTC_Regs *rtc, uint8_t day)
{
    DL_Common_updateReg(&rtc->A2DAY, day, RTC_A2DAY_ADOW_MASK);
}

/**
 *  @brief      Get the day of the week in binary for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return            The day of the week in the RTC calendar
 *
 *  @retval            Value in range: 0-6
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getAlarm2DayOfWeekBinary(RTC_Regs *rtc)
{
    return (uint8_t)(rtc->A2DAY & RTC_A2DAY_ADOW_MASK);
}

/**
 *  @brief      Enable day of the month in binary for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_enableAlarm2DayOfMonthBinary(RTC_Regs *rtc)
{
    rtc->A2DAY |= RTC_A2DAY_ADOMAEBIN_ENABLE;
}

/**
 *  @brief      Disable day of the month in binary for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 */
__STATIC_INLINE void DL_RTC_disableAlarm2DayOfMonthBinary(RTC_Regs *rtc)
{
    rtc->A2DAY &= ~(RTC_A2DAY_ADOMAEBIN_MASK);
}

/**
 *  @brief      Set the day of the month in binary for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *  @param[in]  day    Value for the day of the month of the RTC calendar
 *                     Valid values are 1-31
 */
__STATIC_INLINE void DL_RTC_setAlarm2DayOfMonthBinary(
    RTC_Regs *rtc, uint8_t day)
{
    DL_Common_updateReg(&rtc->A2DAY, (uint32_t) day << RTC_A2DAY_ADOMBIN_OFS,
        RTC_A2DAY_ADOMBIN_MASK);
}

/**
 *  @brief      Get the day of the month in binary for RTC Calendar Alarm 2
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return            The day of the month in the RTC calendar
 *
 *  @retval            Value in range: 1-31
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getAlarm2DayOfMonthBinary(RTC_Regs *rtc)
{
    return (uint8_t)(
        (rtc->A2DAY & RTC_A2DAY_ADOMBIN_MASK) >> RTC_A2DAY_ADOMBIN_OFS);
}

/**
 *  @brief      Set prescale interrupt interval for timer 0 and 1
 *
 *  Set prescale timer interrupt interval to DL_RTC_PRESCALE_NONE to keep the
 *  timer disabled.
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @param[in]  prescaler0Divider    Value to set for prescaler 0
 *                                       interrupt interval
 *                                       One of @ref DL_RTC_PRESCALER0_DIVIDE
 *
 *  @param[in]  prescaler1Divider    Value to set for prescaler 1
 *                                       interrupt interval
 *                                       One of @ref DL_RTC_PRESCALER1_DIVIDE
 */
__STATIC_INLINE void DL_RTC_setPrescalerEvents(RTC_Regs *rtc,
    DL_RTC_PRESCALER0_DIVIDE prescaler0Divider,
    DL_RTC_PRESCALER1_DIVIDE prescaler1Divider)
{
    rtc->PSCTL = (((uint32_t) prescaler0Divider & RTC_PSCTL_RT0IP_MASK) |
                  ((uint32_t) prescaler1Divider & RTC_PSCTL_RT1IP_MASK));
}

/**
 *  @brief      Set periodic alarm 0
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @param[in]  prescaler0Divider  Value to set for prescaler 0 interrupt
 *                                 interval. One of @ref DL_RTC_PRESCALER0_DIVIDE
 *
 */
__STATIC_INLINE void DL_RTC_setPeriodicAlarm0(
    RTC_Regs *rtc, DL_RTC_PRESCALER0_DIVIDE prescaler0Divider)
{
    DL_Common_updateReg(
        &rtc->PSCTL, (uint32_t) prescaler0Divider, RTC_PSCTL_RT0IP_MASK);
}

/**
 *  @brief      Set periodic alarm 1

 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @param[in]  prescaler1Divider  Value to set for prescaler 1 interrupt
 *                                 interval. One of @ref DL_RTC_PRESCALER1_DIVIDE
 */
__STATIC_INLINE void DL_RTC_setPeriodicAlarm1(
    RTC_Regs *rtc, DL_RTC_PRESCALER1_DIVIDE prescaler1Divider)
{
    DL_Common_updateReg(
        &rtc->PSCTL, (uint32_t) prescaler1Divider, RTC_PSCTL_RT1IP_MASK);
}

/**
 *  @brief      Get prescaler 0 interrupt interval
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return            Value for prescaler 0 interrupt interval
 *
 *  @retval            One of @ref DL_RTC_PRESCALER0_DIVIDE
 *
 */
__STATIC_INLINE DL_RTC_PRESCALER0_DIVIDE DL_RTC_getPrescaler0(RTC_Regs *rtc)
{
    uint32_t prescaler = (rtc->PSCTL & RTC_PSCTL_RT0IP_MASK);

    return (DL_RTC_PRESCALER0_DIVIDE)(prescaler);
}

/**
 *  @brief      Get prescaler 1 interrupt interval
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @return            Value for prescaler 1 interrupt interval
 *
 *  @retval            One of @ref DL_RTC_PRESCALER1_DIVIDE
 */
__STATIC_INLINE DL_RTC_PRESCALER1_DIVIDE DL_RTC_getPrescaler1(RTC_Regs *rtc)
{
    uint32_t prescaler = (rtc->PSCTL & RTC_PSCTL_RT1IP_MASK);

    return (DL_RTC_PRESCALER1_DIVIDE)(prescaler);
}

/**
 *  @brief      Enable RTC interrupts
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @param[in]  interruptMask  Bit mask of interrupts to enable. Logical OR of
 *                             @ref DL_RTC_INTERRUPT.
 */
__STATIC_INLINE void DL_RTC_enableInterrupt(
    RTC_Regs *rtc, uint32_t interruptMask)
{
    rtc->CPU_INT.IMASK |= interruptMask;
}

/**
 *  @brief      Disable RTC interrupts
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @param[in]  interruptMask  Bit mask of interrupts to enable. Logical OR of
 *                             @ref DL_RTC_INTERRUPT
 */
__STATIC_INLINE void DL_RTC_disableInterrupt(
    RTC_Regs *rtc, uint32_t interruptMask)
{
    rtc->CPU_INT.IMASK &= ~(interruptMask);
}

/**
 *  @brief      Check which RTC interrupts are enabled
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Logical OR of
 *                             @ref DL_RTC_INTERRUPT
 *
 *  @return     Which of the requested RTC interrupts are enabled
 *
 *  @retval     Logical OR of @ref DL_RTC_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_RTC_getEnabledInterrupts(
    RTC_Regs *rtc, uint32_t interruptMask)
{
    return (rtc->CPU_INT.IMASK & interruptMask);
}

